; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v9 ?v1)
             (pred_9 ?v12 ?v8)
             (pred_8 ?v9 ?v8)
             (pred_6 ?v3 ?v9 )
	     (pred_7 ?v9)
             (pred_5 ?v5)
             (pred_11 ?v12)
             (pred_3 ?v8)
             (pred_2 ?v9)
             (pred_4 ?v12)
             (pred_1 ?v9)
             (pred_12 ))



(:action op_5
:parameters (?v4 ?v6 ?v11 ?v13)
:precondition (and (pred_5 ?v4) (pred_5 ?v6) (pred_11 ?v11) (pred_3 ?v13)
          (pred_10 ?v4 ?v6) (pred_9 ?v11 ?v13)
                   (pred_8 ?v6 ?v13) (pred_7 ?v4) 
                   (pred_2 ?v6) (pred_4 ?v11))
:effect (and  (pred_1 ?v6) (not (pred_2 ?v6))))


(:action op_3
:parameters (?v4 ?v10)
:precondition (and (pred_5 ?v4) (pred_5 ?v10)
               (pred_7 ?v4) (pred_10 ?v4 ?v10) (pred_1 ?v10))
:effect (and (pred_7 ?v10) (not (pred_7 ?v4))))

(:action op_2
:parameters (?v4 ?v11)
:precondition (and (pred_5 ?v4) (pred_11 ?v11) 
                  (pred_7 ?v4) (pred_6 ?v11 ?v4) (pred_12 ))
:effect (and (pred_4 ?v11)
   (not (pred_6 ?v11 ?v4)) (not (pred_12 ))))


(:action op_1
:parameters (?v4 ?v7 ?v2)
:precondition (and (pred_5 ?v4) (pred_11 ?v7) (pred_11 ?v2)
                  (pred_7 ?v4) (pred_4 ?v2) (pred_6 ?v7 ?v4))
:effect (and (pred_4 ?v7) (pred_6 ?v2 ?v4)
        (not (pred_4 ?v2)) (not (pred_6 ?v7 ?v4))))

(:action op_4
:parameters (?v4 ?v11)
:precondition (and (pred_5 ?v4) (pred_11 ?v11) 
                  (pred_7 ?v4) (pred_4 ?v11))
:effect (and (pred_12 ) (pred_6 ?v11 ?v4) (not (pred_4 ?v11)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_13 obj_03 obj_09 obj_04 obj_02 obj_11 obj_06 obj_10 obj_12
    obj_07 obj_05
    obj_01 obj_08
    )

    (:init
       (pred_12)

       (pred_5 obj_13)
       (pred_5 obj_03)
       (pred_5 obj_09)
       (pred_5 obj_04)
       (pred_5 obj_02)
       (pred_5 obj_11)
       (pred_5 obj_06)
       (pred_5 obj_10)
       (pred_5 obj_12)
       (pred_3 obj_07)
       (pred_3 obj_05)
       (pred_11 obj_01)
       (pred_11 obj_08)

       (pred_10 obj_13 obj_04)
       (pred_10 obj_13 obj_03)
       (pred_10 obj_03 obj_02)
       (pred_10 obj_03 obj_09)
       (pred_10 obj_03 obj_13)
       (pred_10 obj_09 obj_11)
       (pred_10 obj_09 obj_03)
       (pred_10 obj_04 obj_06)
       (pred_10 obj_04 obj_02)
       (pred_10 obj_04 obj_13)
       (pred_10 obj_02 obj_10)
       (pred_10 obj_02 obj_11)
       (pred_10 obj_02 obj_03)
       (pred_10 obj_02 obj_04)
       (pred_10 obj_11 obj_12)
       (pred_10 obj_11 obj_09)
       (pred_10 obj_11 obj_02)
       (pred_10 obj_06 obj_10)
       (pred_10 obj_06 obj_04)
       (pred_10 obj_10 obj_12)
       (pred_10 obj_10 obj_02)
       (pred_10 obj_10 obj_06)
       (pred_10 obj_12 obj_11)
       (pred_10 obj_12 obj_10)
       (pred_2 obj_06)
       (pred_2 obj_12)
       (pred_8  obj_06 obj_07)
       (pred_8  obj_12 obj_05)
       (pred_1 obj_13)
       (pred_1 obj_03)
       (pred_1 obj_09)
       (pred_1 obj_04)
       (pred_1 obj_02)
       (pred_1 obj_11)
       (pred_1 obj_10)

       (pred_9  obj_01 obj_07)
       (pred_9  obj_08 obj_05)
       (pred_6 obj_01 obj_03)
       (pred_6 obj_08 obj_09)
       (pred_7 obj_04)
    )

    (:goal (and
       (pred_6 obj_01 obj_11)
       (pred_6 obj_08 obj_04)
    ))
(:constraints
  (always (not (pred_7 obj_02)))
)
)

; plan
1. (op_3 obj_04 obj_13)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_13)
   goals met: 0 of 2
2. (op_3 obj_13 obj_03)
   deleted: (pred_7 obj_13)
   added: (pred_7 obj_03)
   goals met: 0 of 2
3. (op_2 obj_03 obj_01)
   deleted: (pred_6 obj_01 obj_03) (pred_12)
   added: (pred_4 obj_01)
   goals met: 0 of 2
4. (op_3 obj_03 obj_09)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_09)
   goals met: 0 of 2
5. (op_3 obj_09 obj_11)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_11)
   goals met: 0 of 2
6. (op_4 obj_11 obj_01)
   deleted: (pred_4 obj_01)
   added: (pred_12) (pred_6 obj_01 obj_11)
   goals met: 1 of 2
7. (op_3 obj_11 obj_09)
   deleted: (pred_7 obj_11)
   added: (pred_7 obj_09)
   goals met: 1 of 2
8. (op_2 obj_09 obj_08)
   deleted: (pred_6 obj_08 obj_09) (pred_12)
   added: (pred_4 obj_08)
   goals met: 1 of 2
9. (op_3 obj_09 obj_03)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_03)
   goals met: 1 of 2
10. (op_3 obj_03 obj_13)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_13)
   goals met: 1 of 2
11. (op_3 obj_13 obj_04)
   deleted: (pred_7 obj_13)
   added: (pred_7 obj_04)
   goals met: 1 of 2
12. (op_4 obj_04 obj_08)
   deleted: (pred_4 obj_08)
   added: (pred_12) (pred_6 obj_08 obj_04)
   goals met: 2 of 2
